src/templates/node/test/stress.yml
# Stress test for __serviceName__

config:
  target: 'http://localhost:3400'
  phases:
    - duration: 5
      arrivalRate: 2
scenarios:
  - flow:
    - get:
        url: "/auth/apidoc"
    - get:
        url: "/auth/coverage"
    - get:
        url: "/auth/test"

# expect 400
    - get:
        url: "/auth/un-matched"

# Acm routes
############
    - post:
        url: "/auth/acm"
        json:
          "subject": "5cee730bb2820d47582e9abd"
          "accessControl":
              "read": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "update": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "delete": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
        capture:
          - json: $._id
            as: "idAcm"

# expect 400
    - post:
        url: "/auth/acm"
        json:
          "accessControl":
              "read": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "update": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
              "delete": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee7a0493f93a4e65b32630","5cee7a0493f93a4e65b32637"]
    - get:
        url: "/auth/acm"
    - get:
        url: "/auth/acm?page=2"
    - get:
        url: "/auth/acm?_id={{idAcm}}"
# expect 400
    - get:
        url: "/auth/acm?_id=wrongFormat"
    - put:
        url: "/auth/acm?_id={{idAcm}}&operation=pull&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "/auth/acm?_id={{idAcm}}&operation=push&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "/auth/acm?_id={{idAcm}}"
        json:
          "subject": "5cee7a0493f93a4e65b32639"
# expect 400
    - put:
        url: "/auth/acm?_id={{idAcm}}&operation=unknown&target=accessControl.read"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "/auth/acm?_id={{idAcm}}&operation=pull&target=accessControl.unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "/auth/acm?_id={{idAcm}}"
# expect 400
    - delete:
        url: "/auth/acm?_id={{idAcm}}"
# expect 400
    - delete:
        url: "/auth/acm?_id=wrongFormat"


# Role routes
#############
    - post:
        url: "/auth/role"
        json:
          "name": "Role A"
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "POST" ]
        capture:
          - json: $._id
            as: "idRole"
# expect 400
    - post:
        url: "/auth/role"
        json:
          "name": "Role A"
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "UNKNOWN_METHOD" ]
# expect 400
    - post:
        url: "/auth/role"
        json:
          "description": "Role A description"
          "members": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639", "5cee730bb2820d47582e9abd"]
          "accessRoutes": [ "route": "http://sample/route/1", "method": "POST" ]
    - get:
        url: "/auth/role"
    - get:
        url: "/auth/role?page=2"
    - get:
        url: "/auth/role?_id={{idRole}}"
# expect 400
    - get:
        url: "/auth/role?_id=wrongFormat"
    - put:
        url: "/auth/role?_id={{idRole}}&operation=push&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "/auth/role?_id={{idRole}}"
        json:
          "name": "New name"
    - put:
        url: "/auth/role?_id={{idRole}}&operation=pull&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "/auth/role?_id={{idRole}}&operation=pull&target=unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "/auth/role?_id={{idRole}}&operation=unknown&target=members"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "/auth/role?_id={{idRole}}"
# expect 400
    - delete:
        url: "/auth/role?_id={{idRole}}"
# expect 400
    - delete:
        url: "/auth/role?_id=wrongFormat"


# Service routes
################
    - post:
        url: "/auth/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
        capture:
          - json: $._id
            as: "idService"
# expect 400
    - post:
        url: "/auth/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
# expect 400
    - post:
        url: "/auth/service"
        json:
          "name": "Service A"
          "serviceId": "02"
          "routes": [ "route": "http://sample/route/1", "method": "POST", "group": "Company", "name": "Create company", "description": "Create company data"]
    - get:
        url: "/auth/service"
    - get:
        url: "/auth/service?page=2"
    - get:
        url: "/auth/service?_id={{idService}}"
# expect 400
    - get:
        url: "/auth/service?_id=wrongFormat"
    - put:
        url: "/auth/service?_id={{idService}}&operation=push&target=routes"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - put:
        url: "/auth/service?_id={{idService}}&operation=pull&target=routes"
        json:
          "name": "newName"
    - put:
        url: "/auth/service?_id={{idService}}"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "/auth/service?_id={{idService}}&operation=pull&target=unknown"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
# expect 400
    - put:
        url: "/auth/service?_id={{idService}}&operation=unknown&target=routes"
        json:
          "data": ["5cee7a0493f93a4e65b32638","5cee7a0493f93a4e65b32639"]
    - delete:
        url: "/auth/service?_id={{idService}}"
# expect 400
    - delete:
        url: "/auth/service?_id={{idService}}"
# expect 400
    - delete:
        url: "/auth/service?_id=wrongFormat"


# Token routes
##############
    - post:
        url: "/auth/token/create"
        json:
          "userId": "5cee730bb2820d47582e9abd"
        capture:
          - json: $.token
            as: "token"
    - post:
        url: "/auth/token/validate"
        json:
          "route": "http://sample/route/1"
          "method": "PUT"
          "body":
            "one": "one"
          "objectId": "5cee7a0493f93a4e65b32638"
          "token": {{token}}
    - post:
        url: "/auth/token/validate"
        json:
          "route": "http://sample/route/1"
          "method": "DELETE"
          "body":
            "one": "one"
          "objectId": "5cee7a0493f93a4e33b32638"
          "token": {{token}}

# User routes
################
    - post:
        url: "/auth/user"
        json:
          "userId": "sample@gmail.com"
        capture:
          - json: $._id
            as: "idUser"
# expect 400
    - post:
        url: "/auth/user"
        json:
          "userId": "sample@gmail.com"
# expect 400
    - post:
        url: "/auth/user"
        json:
          "userId": "sample@gmail.com"
    - get:
        url: "/auth/user"
    - get:
        url: "/auth/user?page=2"
    - get:
        url: "/auth/user?_id={{idUser}}"
# expect 400
    - get:
        url: "/auth/user?_id=wrongFormat"
    - put:
        url: "/auth/user?_id={{idUser}}"
        json:
          "userId": "sample@gmail.com"
    - delete:
        url: "/auth/user?_id={{idUser}}"
# expect 400
    - delete:
        url: "/auth/user?_id={{idUser}}"
# expect 400
    - delete:
        url: "/auth/user?_id=wrongFormat"